app/controllers/incomeclassifications_controller.rb

  def index
    @title = "Income classifications"
    @incomeclassifications = Incomeclassification.paginate(:page => params[:page], :per_page => 4,:order => "id ASC")
---
SELECT * FROM "incomeclassifications" ORDER BY id ASC LIMIT 4 OFFSET 0
SELECT count(*) AS count_all FROM "incomeclassifications"

  def show
    @incomeclassification = Incomeclassification.find(params[:id])
---
SELECT * FROM "incomeclassifications" WHERE ("incomeclassifications"."id" = 3)

  def edit
    @incomeclassification = Incomeclassification.find(params[:id])
---
SELECT * FROM "incomeclassifications" WHERE ("incomeclassifications"."id" = 3)

  def create
    @incomeclassification = Incomeclassification.new(params[:incomeclassification])

    respond_to do |format|
      if @incomeclassification.save
---
INSERT INTO "incomeclassifications" ("description", "created_at", "updated_at") VALUES('inc3', '2010-12-31 08:57:51', '2010-12-31 08:57:51')

  def update
    @incomeclassification = Incomeclassification.find(params[:id])

    respond_to do |format|
      if @incomeclassification.update_attributes(params[:incomeclassification])
---
SELECT * FROM "incomeclassifications" WHERE ("incomeclassifications"."id" = 3)
UPDATE "incomeclassifications" SET "description" = 'inc3sdew', "updated_at" = '2010-12-31 08:58:05' WHERE "id" = 3

  def destroy
    @incomeclassification = Incomeclassification.find(params[:id])
    @incomeclassification.destroy
---
SELECT * FROM "incomeclassifications" WHERE ("incomeclassifications"."id" = 3)
DELETE FROM "incomeclassifications" WHERE "id" = 3