app/controllers/occupationclassifications_controller.rb

SELECT * FROM "occupationclassifications" ORDER BY description ASC LIMIT 4 OFFSET 0
SELECT count(*) AS count_all FROM "occupationclassifications"
---
  def index
    @occupationclassifications = Occupationclassification.paginate(:page => params[:page], :per_page => 4, :order => "description ASC")

SELECT * FROM "occupationclassifications" WHERE ("occupationclassifications"."id" = 4)
---
  def show
    @occupationclassification = Occupationclassification.find(params[:id])

SELECT * FROM "occupationclassifications" WHERE ("occupationclassifications"."id" = 4)
---
  def edit
    @occupationclassification = Occupationclassification.find(params[:id])

INSERT INTO "occupationclassifications" ("description", "created_at", "updated_at") VALUES('occup2', '2010-12-31 09:02:11', '2010-12-31 09:02:11')
---
  def create
    @occupationclassification = Occupationclassification.new(params[:occupationclassification])

    respond_to do |format|
      if @occupationclassification.save

SELECT * FROM "occupationclassifications" WHERE ("occupationclassifications"."id" = 4)
UPDATE "occupationclassifications" SET "description" = 'occupation class2', "updated_at" = '2010-12-31 09:02:28' WHERE "id" = 4
---
  def update
    @occupationclassification = Occupationclassification.find(params[:id])

    respond_to do |format|
      if @occupationclassification.update_attributes(params[:occupationclassification])

SELECT * FROM "occupationclassifications" WHERE ("occupationclassifications"."id" = 2)
DELETE FROM "occupationclassifications" WHERE "id" = 2
---
  def destroy
    @occupationclassification = Occupationclassification.find(params[:id])
    @occupationclassification.destroy