app/controllers/partyroles_controller.rb

SELECT * FROM "partyroles" WHERE (party_id = '8')
SELECT * FROM "roles" WHERE ("roles"."id" = 1)
---
  def index
    unless ("#{params[:party_id]}".empty? || "#{params[:party_id]}".nil? || "#{params[:party_id]}" == 0)
      $party_id = "#{params[:party_id]}"
    end
    @partyroles = Partyrole.find(:all, :conditions => ["party_id = ?", $party_id])

SELECT * FROM "partyroles" WHERE (party_id = '2')
SELECT * FROM "roles" WHERE ("roles"."id" = 2)
---
  def show
    @partyroles = Partyrole.find(:all, :conditions => ["party_id = ?", $party_id])

SELECT * FROM "roles" WHERE (id NOT IN (0,2,5))
SELECT role_id FROM "partyroles" WHERE (party_id = '2')
---
  def new
    $party_id = "#{params[:party_id]}"
    @person = Person.find(:first, :conditions => ["party_id = ?", $party_id], :select => "party_id, current_last_name, current_first_name")
    @partyrole = Partyrole.new

    @role_for_party = Partyrole.find(:all, :conditions => ["party_id = ?", $party_id], :select => "role_id")

SELECT * FROM "partyroles" WHERE ("partyroles"."id" = 8)
---
  def edit
    @partyrole = Partyrole.find(params[:id])

INSERT INTO "partyroles" ("party_id", "role_id", "created_at", "updated_at") VALUES(2, 3, '2010-12-31 09:56:47', '2010-12-31 09:56:47')
---
  def create
    @partyrole = Partyrole.new(params[:partyrole])

    respond_to do |format|
      if @partyrole.save

SELECT * FROM "partyroles" WHERE ("partyroles"."id" = 7)
DELETE FROM "partyroles" WHERE "id" = 7
---
  def destroy
    @partyrole = Partyrole.find(params[:id])
    @partyrole.destroy