app/controllers/people_controller.rb

SELECT * FROM "incomeclassifications" WHERE ("incomeclassifications"."id" = '4') LIMIT 1
SELECT * FROM "occupationclassifications" WHERE ("occupationclassifications"."id" = 3)
---
  def search_classi
    @title = "Search form incomeclassification"

    $birthdate_low = Date.today - params[:age_high][:value].to_i.years unless params[:age_high].nil?
    $birthdate_high = Date.today - params[:age_low][:value].to_i.years unless params[:age_low].nil?


    unless params[:classify].nil?
      if params[:classify][:incomeclassification_id].empty?
        ic_selected_param = ""
        sql_insert_ic = ""
      else
        ic_description = Incomeclassification.find(params[:classify][:incomeclassification_id]).description
        ic_selected_param = "<br />Income classification: <b>#{ic_description}</b>"
        $ic_id = params[:classify][:incomeclassification_id]
        sql_insert_ic = "p.incomeclassification_id = :ic_id AND "
      end

      if params[:classify][:occupationclassification_id].empty?
        oc_selected_param = ""
        sql_insert_oc = ""
      else
        oc_description = Occupationclassification.find(params[:classify][:occupationclassification_id]).description

SELECT * FROM "partyroles" WHERE (party_id = 6)
SELECT * FROM "roles" WHERE ("roles"."id" = 4)
---
  def show
    unless (params[:party_id].nil? || params[:party_id] == 0)
      $party_id = params[:party_id]
    end
    @person = Person.find($party_id)
    @partyroles = Partyrole.find(:all, :conditions => ["party_id = ?", $party_id])

INSERT INTO "parties" ("created_at", "updated_at") VALUES('2010-12-31 09:42:31', '2010-12-31 09:42:31')
---
  def create
    @person = Person.new(params[:person])
    @person.party_id = Party.create[:id]