app/controllers/rights_controller.rb

  def index
    @rights = Right.all
---
SELECT * FROM "rights"

  def show
    @right = Right.find(params[:id])
---
SELECT * FROM "rights" WHERE ("rights"."id" = 1)

  def edit
    @right = Right.find(params[:id])
---
SELECT * FROM "rights" WHERE ("rights"."id" = 1)

  def create
    @right = Right.new(params[:right])

    respond_to do |format|
      if @right.save
---
INSERT INTO "rights" ("description", "created_at", "updated_at") VALUES('Regular user', '2011-01-04 13:35:52', '2011-01-04 13:35:52')

  def destroy
    @right = Right.find(params[:id])
    @right.destroy
---
SELECT * FROM "rights" WHERE ("rights"."id" = 2)
DELETE FROM "rights" WHERE "id" = 2