app/controllers/roles_controller.rb

  def index
    @title = "Roles management"
    @roles = Role.paginate(:page => params[:page], :per_page => 4)
---
SELECT * FROM "roles" LIMIT 4 OFFSET 0
SELECT count(*) AS count_all FROM "roles"

  def show
    @role = Role.find(params[:id])
---
SELECT * FROM "roles" WHERE ("roles"."id" = 1)

  def edit
    @role = Role.find(params[:id])
---
SELECT * FROM "roles" WHERE ("roles"."id" = 2)

  def create
    @role = Role.new(params[:role])

    respond_to do |format|
      if @role.save
---
INSERT INTO "roles" ("description", "created_at", "updated_at") VALUES('Employee', '2010-12-06 17:00:25', '2010-12-06 17:00:25')