app/controllers/userrights_controller.rb

SELECT right_id FROM "userrights" WHERE (party_id = 1)
SELECT username FROM "users" WHERE (party_id = '2') LIMIT 1
---
  def index
    $user_id = params[:user_id]
    @userrights = Userright.find_all_by_user_id(params[:user_id])

    unless !( @userrights.nil? || @userrights.empty? )

SELECT * FROM "rights" WHERE ("rights"."id" = 1)
SELECT * FROM "userrights" WHERE ("userrights"."id" = 2)
---
  def show
    @userright = Userright.find(params[:id])

SELECT username FROM "users" WHERE (party_id = '2') LIMIT 1
SELECT * FROM "rights" WHERE (id NOT IN (0))
SELECT right_id FROM "userrights" WHERE (party_id = '2')
SELECT * FROM "rights"
---
  def new
    @user = User.find(params[:user_id])
    @userright = Userright.new
    #$party_id = params[:party_id]

    # dropdown box shall contain only not yet assigned rights
    right_for_user = Userright.find(:all, :conditions => ["user_id = ?", params[:user_id]], :select => "right_id")
    right_id_for_user = Array.new << 0
    length = right_for_user.length

INSERT INTO "userrights" ("party_id", "right_id", "created_at", "updated_at") VALUES(2, 1, '2010-12-31 10:06:05', '2010-12-31 10:06:05')
---
  def create
    @userright = Userright.new(params[:userright])

    respond_to do |format|
      if @userright.save

SELECT * FROM "userrights" WHERE ("userrights"."id" = 2)
DELETE FROM "userrights" WHERE "id" = 2
---
  def destroy
    @userright = Userright.find(params[:id])
    @userright.destroy