app/controllers/userrights_controller.rb

  def index
    unless ("#{params[:party_id]}".empty? || "#{params[:party_id]}".nil? || "#{params[:party_id]}" == 0)
      $party_id = "#{params[:party_id]}"
    end
    @userrights = Userright.find(:all, :conditions => ["party_id = ?", $party_id])
---
SELECT * FROM "rights" WHERE ("rights"."id" = 1)

  def edit
    @userright = Userright.find(params[:id])
---
SELECT * FROM "rights" WHERE (id NOT IN (0,1))
SELECT * FROM "userrights" WHERE ("userrights"."id" = 3)

  def update
    @userright = Userright.find(params[:id])

    respond_to do |format|
      if @userright.update_attributes(params[:userright])
---
SELECT * FROM "userrights" WHERE ("userrights"."id" = 4)
UPDATE "userrights" SET "right_id" = 1, "updated_at" = '2011-01-04 17:09:37' WHERE "id" = 4