app/controllers/users_controller.rb

  def index
    @title ="Listing user accounts"
    if !params[:user_id].nil?
      @users = User.paginate(:page => params[:page], :conditions => ['id = ?', params[:user_id]])     # to find only the one user record with the provided :user_id
---
SELECT * FROM "users" WHERE (party_id = '6') LIMIT 1

  def show
    @tilte = "Show user account"
    @user = User.find(params[:id])

    unless @user.userrights.any?
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
SELECT right_id FROM "userrights" WHERE (party_id = 1)

  def create
    @person = Person.find_by_party_id($party_id, :select => "party_id, current_last_name, current_first_name")  # is necessary in the case of multiple calls for this method - this is the case if user could not be saved (e.g. password to short etc.)
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("party_id", "username", "encrypted_password", "salt", "created_at", "updated_at", "remember_token") VALUES(2, 'jensuser', 'a760f43d939c5c43dd08e9dc2cc7caf92b3c41f953106e4c66ea8f8cb980d966', 'dccc53fc561d55e8cdfc02d694ada818a789a3454da13141546c139c120a4296', '2010-12-31 10:05:34', '2010-12-31 10:05:34', NULL)

  def update
    #@user = User.find(params[:id])  # to find the user is already done by: before_filter :correct_user

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
UPDATE "users" SET "salt" = 'fbd4046f0bf3adbe08ffd14fef5d03871c77891b161bb37254555a62e48e1d3f', "encrypted_password" = '80365de78ac6f25dc22a28fe91f966683524fe1360eb717e4b7a4dbb50d4db40', "updated_at" = '2011-01-04 13:23:39' WHERE "id" = 2

  def destroy
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.destroy
---
SELECT * FROM "users" WHERE ("users"."id" = 2)
DELETE FROM "users" WHERE "id" = 2